video_list = [
    "BV1CT42117o6", # 现代人就该用高科技解决问题，搞笑视频，动画
    "BV1sJ4m1p7P3", # 虚一直构｜《与砂金总监的一日约会》，游戏官方，双方骂战
    "BV19x4y1a7PB", # 【原神HoYoFair】等级不是问题，二创动画，3D MMD
    "BV11E421T7mx", # 全网首发！UP主亲身实弹测试！特斯拉赛博皮卡到底防不放弹？，科技，汽车，枪械
    "BV1Np421X7Mg", # 在日本买到千年前的中国古董，是真是假？, 生活，日常，文物，收藏，旅游
    "BV1KJ4m1p7MT", # 中学生、大学生、社会人，谁的知识储备更多？, 知识，人文历史，学习，历史
    "BV17i421f7VX", # 【毕导】重大的决定有时往往只是一瞬间, 生活，日常，VLOG，百大UP主
    "BV1Dx421m7Wa", # 啃硫黄乱象频出！是治病还是索命？,知识，科学科普，健康，中药
    "BV1i6421g7K7", # 你 解 冻 了 是 吧？！
    "BV1Sr421V7tZ", # 狠狠教训这些浪费食物的网红
    "BV1iC411G7aN", # 满足了甲方的癖好♥, 搞笑视频
    "BV1AC41137Sr", # 这个家没王妈真得散！！, 搞笑视频
    "BV1Qx4y1Y7XU", # 张镇辉台球正经教学【6个不太建议使用的技巧】18.0版本, 运动，台球，教学
    "BV17z421C7yw", # 在吗？结婚！, 知识，学习，高考
    "BV1Mp421X7Wx", # 当我带老爸欣赏弱智吧语录，看完感觉我才是弱智
    "BV1zC411G7aG", # 跟大家聊聊猫一杯吧，这种短视频风气我实在不吐不快
    "BV1hz421C7BH",
    "BV1aC411G7jT",
    "BV18H4y1K7RW",
    "BV1bA4m1c7F1",
    "BV11m411z7rx",
    "BV1xm411B72e",
    "BV1em411B7bG",
    "BV1jz421C7tP",
    "BV1PE421u7UV",
    "BV1RA4m1F7da",
    "BV1u1421Z71P",
    "BV1tD421p74Z",
    "BV151421Z7p9",
    "BV1KT421U7Dv",
    "BV1Gm421j7Lg",
    "BV1sJ4m1p7d7",
    "BV1xm411B7oT",
    "BV1AH4y1M7jB",
]

sci_videos = [
    "BV19u4y1D7GT", # 【毕导】这个视频里说的都是真的，但你却永远无法证明
    "BV1ha4y157tg", # 【毕导】你会点进这个视频，并一脸懵逼地出去，而这一切已被物理规律注定了
    "BV1ys411472E", # 【官方双语/合集】线性代数的本质 - 系列合集, 课程
    "BV1bx411M7Zx", # 【官方双语】深度学习之神经网络的结构 Part 1 ver 2.0
    "BV1wi421f71U", # 为什么制作蓝LED几乎是不可能的
    "BV1QR4y1A7bf", # 一位科学家一不小心夺走了数亿人的生命
    
]